---
kind: method
id: M:Autodesk.Revit.DB.CurveElement.GetLineStyleIds
source: html/3e30d0b4-6c74-18bf-043f-2430ff9ac17b.htm
---
# Autodesk.Revit.DB.CurveElement.GetLineStyleIds Method

Ids of all line style Elements that are applicable to this curve element.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetLineStyleIds()
```

## Returns
A collection of Ids of line style elements.

## Remarks
The elements are of the [!:Autodesk::Revit::DB::GraphicsStyle] class.